# DWFExportOptions Class

---
DWF Export options.
SystemObject Autodesk.Revit.DBCADExportOptions Autodesk.Revit.DBDWFExportOptions Autodesk.Revit.DBDWFXExportOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class DWFExportOptions : CADExportOptions

    Public Class DWFExportOptions
    	Inherits CADExportOptions

    public ref class DWFExportOptions : public CADExportOptions

    type DWFExportOptions =
        class
            inherit CADExportOptions
        end
The DWFExportOptions type exposes the following members.
| Name| Description
---|---|---
| DWFExportOptions| Default constructor. Sets all options to their default values.
Top
| Name| Description
---|---|---
| CropBoxVisible| Whether to export crop box.
| ExportingAreas| Whether to also export areas and rooms' geometry.
| ExportObjectData| Whether to include properties associated with elements.
| ExportOnlyViewId| Only export the specified view.
| ExportTexture| Whether to export texture.
| ImageFormat| Controls the compression level of images embedded.
| ImageQuality| Image quality level when compressed raster format(JPEG) is used.
| MergedViews| Whether to merge all views in one file.
| PaperFormat| Standard paper format.
| PortraitLayout| Paper orientation - Portrait/Landscape.
| StopOnError| Whether export process should stop when a view fails to export.
Top
| Name| Description
---|---|---
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace